// pages/notes/notes.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
      notes:['1、小程序获取数据都将是实时的，所以每次需要向教务处网站发起请求，这需要大概30秒或更久。', '2、如果发现课表或查询结果不正确，试着取消教务绑定，重新登录。','3、本小程序仅供学习和参考，相关信息版权归原作者所有。', '4、使用过程中有任何疑问或发现小程序有某些问题，请与开发者联系，十分感谢您的理解和支持！']
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
  
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {
  
  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {
  
  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {
  
  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {
  
  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {
  
  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {
  
  },

  /**
   * 用户点击右上角分享
   */

})